import { generateGui } from "@/lib/iagui/generate-gui";
import Image from "next/image";

export const Root = generateGui({
    id: "uigh",
    name: "公会系统 / 主菜单",
    descriptions: [
        "提升公会等级需要 公会资金 和 公会活跃",
        "升级公会可以提升全部成员的攻击、生命等属性",
        "#emptyline",
        "公会资金 是通过公会成员捐献公会币获得的",
        "公会活跃 是通过公会神石产出或商城等渠道获得的",
        "公会币是 通过公会签到/任务或商城等渠道获得的",
        "#emptyline",
        "这就是 公会币 公会资金 公会活跃 的详细讲解",
    ],
    map: [
        ["#", "#", "#", "#", "#", "#", "#", "#", "#"],
        ["#", "#", "#", "#", "#", "#", "#", "#", "#"],
        ["#", "#", "#", "#", "#", "#", "#", "#", "#"],
        ["#", "#", "#", "#", "#", "#", "#", "#", "#"],
        ["B", "b", "b", "#", "#", "#", "#", "#", "#"],
        ["B", "b", "b", "#", "#", "#", "#", "#", "#"],
    ],
    palette: {
        B: {
            onClick: {
                action: "redirect",
                href: "/wiki/acknowledge/menu?current=uicd",
            },
        },
        b: {
            onClick: {
                action: "navigate",
                to: "uighview",
            },
        },
    },
});

export const View = generateGui({
    id: "uighview",
    name: "公会系统 / 操作面板",
    descriptions: [
        "在这里可以做所有和公会相关的操作",
        "#separator",
        "[公会战] 报名参加公会战",
        "[管理] 会长或者副会长的公会管理入口",
        "[神石] 升级活跃神石、Buff 神石或者挖掘矿石",
        "[成员] 查看或管理你的公会成员",
        "[称号] 查看当前公会称号等级和属性",
        "[贡献] 将 公会币 转入公会变成 公会资金",
        "[商店] 上架或购买只有公会成员可以用公会币买的物品",
        "[签到] 使用水晶或者金币签到获得每日公会币",
        "[任务] 查看本周公会共同任务，一起和公会成员完成，奖励在每周日的 12:00 发放",
        "[主城] 快速传送回会长设置好的公会主城",
        "[公告] 查看或发布新的公会公告",
        "#emptyline",
        "[退出] 离开当前公会，注意你的公会币会被清零，并在这之后有 1 小时的冷却期，冷却期内没法加入新的公会",
        "#separator",
        "你可以点击对应按钮浏览详情",
    ],
    map: [
        ["a", "a", "a", "a", "a", "b", "b", "b", "b"],
        ["a", "a", "a", "a", "a", "c", "c", "c", "c"],
        ["a", "a", "a", "a", "a", "d", "d", "d", "d"],
        ["a", "a", "a", "a", "a", "e", "e", "e", "e"],
        ["B", "f", "f", "g", "g", "h", "h", "h", "h"],
        ["B", "j", "j", "k", "k", "#", "#", "m", "m"],
    ],
    palette: {
        B: {
            onClick: {
                action: "navigate",
                to: "uigh",
            },
        },
        a: {
            onClick: {
                action: "navigate",
                to: "uighpvp",
            },
        },
        b: {
            onClick: {
                action: "navigate",
                to: "uightitle",
            },
        },
        c: {
            onClick: {
                action: "navigate",
                to: "uighbank",
            },
        },
        d: {
            onClick: {
                action: "navigate",
                to: "uighshop",
            },
        },
        e: {
            onClick: {
                action: "navigate",
                to: "uighqd",
            },
        },
        f: {
            onClick: {
                action: "navigate",
                to: "uighsj",
            },
        },
        g: {
            onClick: {
                action: "navigate",
                to: "uighstone",
            },
        },
        h: {
            onClick: {
                action: "navigate",
                to: "uightask",
            },
        },
        j: {
            onClick: {
                action: "navigate",
                to: "uightc",
            },
        },
        k: {
            onClick: {
                action: "navigate",
                to: "uighnember",
            },
        },
        m: {
            onClick: {
                action: "navigate",
                to: "uighnotice",
            },
        },
    },
});

export const Pvp = generateGui({
    id: "uighpvp",
    name: "公会系统 / 公会战",
    descriptions: [
        "公会战是一项集体战斗，需要公会成员齐心协力，面对其他公会的挑战",
        "非比赛日可进行报名",
        "#separator",
        "[赛季公会战]",
        "每周六 19:00 全服开战",
        "超多奖励 拿到手软",
        "#separator",
        "[匹配公会战]",
        "匹配公会战-公平模式，统一属性，统一装备",
        "随时随地即可战斗，胜利方可获得贡献奖励，每日最多获得 1 次奖励",
    ],
    map: [
        ["#", "#", "#", "#", "#", "#", "#", "#", "#"],
        ["#", "#", "#", "#", "#", "#", "#", "#", "#"],
        ["#", "#", "#", "#", "#", "#", "#", "#", "#"],
        ["#", "#", "#", "#", "#", "#", "#", "#", "#"],
        ["#", "#", "#", "#", "#", "#", "#", "#", "#"],
        ["#", "#", "#", "#", "B", "#", "#", "#", "#"],
    ],
    palette: {
        B: {
            onClick: {
                action: "navigate",
                to: "uighview",
            },
        },
    },
});

export const Sj = generateGui({
    id: "uighsj",
    name: "公会系统 / 管理公会",
    descriptions: [
        "在这个页面上，公会会长和副会长可以管理公会的各个功能",
        "#separator",
        "[公会升级] 满足一定条件之后升级公会等级 (点击查看详情)",
        "[队伤] 开启或关闭公会成员间 PVP，建议在公会战或者挑战地牢时禁止 PVP",
        "[图标仓库] 查看本公会拥有的图标，装上后可在公会列表里看到",
        "[图标商城] 需要消耗公会资金购买图标，购买后在上方仓库中使用",
        "[公会改名] 花费 2000 公会资金可以修改公会的名称",
        "[邀请] 邀请同一大区中没有公会的玩家加入公会，一次消耗 10 公会资金",
        "[审批] 审核其他玩家加入公会的请求",
        "[主城] 设置公会主城坐标，设置后公会成员可以快速回城",
        "[描述] 修改公会介绍，好的介绍可以为你招来更多萌新哦",
        "[模式] 设置加入模式，会长审批 或 自动审批，自动模式下无需同意即可加入",
        "[解散] 解散公会，解散之后无法复原，如果你不想拥有公会可以转交会长职位",
    ],
    map: [
        ["a", "a", "a", "#", "#", "#", "#", "#", "#"],
        ["a", "a", "a", "#", "#", "#", "#", "#", "#"],
        ["a", "a", "a", "#", "#", "#", "#", "#", "#"],
        ["a", "a", "a", "#", "#", "#", "#", "#", "#"],
        ["B", "#", "#", "#", "#", "#", "#", "#", "#"],
        ["B", "#", "#", "#", "#", "#", "#", "#", "#"],
    ],
    palette: {
        B: {
            onClick: {
                action: "navigate",
                to: "uighview",
            },
        },
        a: {
            onClick: {
                action: "redirect",
                href: "/wiki/playerguild/update#升级公会"
            }
        }
    },
});

export const Stone = generateGui({
    id: "uighstone",
    name: "公会系统 / 神石升级",
    descriptions: [
        "公会神石可以定时产出公会活跃，或是提供全员 Buff 加成",
        "#emptyline",
        "活跃神石 (最左侧大按钮)",
        "每间隔 5 分钟，自动按照当前公会在线成员人数产生 人数 * 5 的公会活跃",
        "#emptyline",
        "Buff 神石 (右侧水晶图标)",
        "通过使用矿石升级 Buff 神石，所有公会成员都能获得 Buff 加成，目前推出的有：",
        "绿色-体力Buff · 蓝色-法力Buff · 红色-攻击Buff · 黄色-生命Buff",
        "#emptyline",
        "矿石 (右侧镐子图标)",
        "普通玩家每日可挖掘一次矿石，矿石可以用于提升任意 Buff 神石的等级，目前推出的有：",
        "普通镐子 · 一次挖掘可获得 1-5 矿石，需要 100 公会币",
        "优质镐子 · 一次挖掘可获得 5-10 矿石，需要 300 公会币",
        "传说镐子 · 一次挖掘可获得 10-15 矿石，需要 500 公会币",
    ],
    map: [
        ["#", "#", "#", "#", "#", "a", "b", "c", "#"],
        ["#", "#", "#", "#", "#", "d", "#", "#", "#"],
        ["#", "#", "#", "#", "#", "#", "#", "#", "#"],
        ["#", "#", "#", "#", "#", "#", "#", "#", "#"],
        ["#", "#", "#", "#", "#", "#", "#", "#", "#"],
        ["#", "#", "#", "#", "B", "#", "#", "#", "#"],
    ],
    palette: {
        B: {
            onClick: {
                action: "navigate",
                to: "uighview",
            },
        },
        a: {
            content: (
                <Image
                    src="/wiki/menuitem/体力Buff.png"
                    alt="体力Buff"
                    width={160}
                    height={160}
                    className="raw-image aspect-square w-[85%]!"
                />
            ),
        },
        b: {
            content: (
                <Image
                    src="/wiki/menuitem/法力Buff.png"
                    alt="法力Buff"
                    width={160}
                    height={160}
                    className="raw-image aspect-square w-[85%]!"
                />
            ),
        },
        c: {
            content: (
                <Image
                    src="/wiki/menuitem/攻击Buff.png"
                    alt="攻击Buff"
                    width={160}
                    height={160}
                    className="raw-image aspect-square w-[85%]!"
                />
            ),
        },
        d: {
            content: (
                <Image
                    src="/wiki/menuitem/生命Buff.png"
                    alt="生命Buff"
                    width={160}
                    height={160}
                    className="raw-image aspect-square w-[85%]!"
                />
            ),
        },
    },
});

export const Member = generateGui({
    id: "uighnember",
    name: "公会系统 / 成员列表",
    descriptions: [
        "在这个页面上你可以查看公会中的所有成员",
        "如果你的公会人数很多，你可以用最右侧的上下按钮翻页",
        "每一个头像表示一个公会成员，可以将鼠标放在上面查询到对应成员的公会信息",
        "包括职位、贡献排名、捐献矿石、捐献公会币、剩余公会币、入会时间 和 上次登录时间",
        "#emptyline",
        "同时，如果你是会长或者副会长，你有权限操作成员的身份，包括升级、降级和踢出公会",
        "成员身份的等级分别是：会长 > 副会长 > 精英 > 成员",
        "#separator",
        "(点击左侧任意一个头像打开身份操作指南)",
    ],
    map: [
        ["#", "#", "#", "#", "#", "a", "b", "#", "#"],
        ["#", "#", "#", "#", "#", "#", "#", "#", "#"],
        ["#", "#", "#", "#", "#", "#", "#", "#", "#"],
        ["#", "#", "#", "#", "#", "#", "#", "#", "#"],
        ["#", "#", "#", "#", "#", "#", "#", "#", "#"],
        ["#", "#", "#", "#", "B", "#", "#", "#", "#"],
    ],
    palette: {
        B: {
            onClick: {
                action: "navigate",
                to: "uighview",
            },
        },
        a: {
            content: (
                <Image
                    src="/wiki/menuitem/[LingyunAwA].png"
                    alt="LingyunAwA"
                    width={160}
                    height={160}
                    className="raw-image aspect-square w-[85%]!"
                />
            ),
            onClick: {
                action: "navigate",
                to: "uighcygl",
            },
        },
        b: {
            content: (
                <Image
                    src="/wiki/menuitem/[NeonTundra].png"
                    alt="NeonTundra"
                    width={160}
                    height={160}
                    className="raw-image aspect-square w-[85%]!"
                />
            ),
            onClick: {
                action: "navigate",
                to: "uighcygl",
            },
        },
    },
});

export const Cygl = generateGui({
    id: "uighcygl",
    name: "公会系统 / 成员操作面板",
    descriptions: [
        "在这个页面上你可以修改公会成员的职位",
        "成员身份的等级分别是：会长 > 副会长 > 精英 > 成员",
        "#separator",
        "升职",
        "你可以使用该按钮提升成员的身份",
        "如果你尝试提升一个 副会长 身份的成员，会在操作进行前向你确认",
        "点击确认后将移交会长职位",
        "#emptyline",
        "降职",
        "你可以使用该按钮降低成员的身份",
        "#emptyline",
        "踢出",
        "你可以使用该按钮直接踢出一名成员",
        "点击之后，成员即刻失去公会身份，未捐献的公会币将清零",
    ],
    map: [
        ["#", "#", "#", "#", "#", "#", "#", "#", "#"],
        ["#", "#", "#", "#", "#", "#", "#", "#", "#"],
        ["#", "#", "#", "#", "#", "#", "#", "#", "#"],
        ["#", "#", "#", "#", "#", "#", "#", "#", "#"],
        ["#", "#", "#", "#", "#", "#", "#", "#", "#"],
        ["#", "#", "#", "#", "B", "#", "#", "#", "#"],
    ],
    palette: {
        B: {
            onClick: {
                action: "navigate",
                to: "uighnember",
            },
        },
    },
});

export const Title = generateGui({
    id: "uightitle",
    name: "公会系统 / 成员操作面板",
    descriptions: [
        "在这个页面上你可以查看公会称号目前和下一级的属性信息",
        "随着公会等级提升，称号等级跟随着提升，生命值和攻击力加成也会增加",
        "#separator",
        "(点击任意按钮查看详细信息)",
    ],
    map: [
        ["#", "#", "#", "#", "#", "#", "#", "#", "#"],
        ["#", "a", "a", "a", "#", "a", "a", "a", "#"],
        ["#", "a", "a", "a", "#", "a", "a", "a", "#"],
        ["#", "a", "a", "a", "#", "a", "a", "a", "#"],
        ["#", "#", "#", "#", "#", "#", "#", "#", "#"],
        ["#", "#", "#", "#", "B", "#", "#", "#", "#"],
    ],
    palette: {
        B: {
            onClick: {
                action: "navigate",
                to: "uighview",
            },
        },
        a: {
            onClick: {
                action: "redirect",
                href: "/wiki/playerguild/update#升级收益",
            },
        },
    },
});

export const Bank = generateGui({
    id: "uighbank",
    name: "公会系统 / 公会贡献",
    descriptions: [
        "在这个页面上你可以将自己的公会币捐献到公会，变为公会资金",
        "贡献后可以增加公会总资金，用于提升排名、升级公会等操作",
        "#emptyline",
        "[小额] 贡献 100 公会币",
        "[大额] 贡献 500 公会币",
        "[全额] 贡献你所有的公会币",
        "[自定义] 贡献指定量的公会币，点击之后在聊天栏输入数字确认",
    ],
    map: [
        ["#", "#", "#", "#", "#", "#", "#", "#", "#"],
        ["#", "#", "#", "#", "#", "#", "#", "#", "#"],
        ["#", "#", "#", "#", "#", "#", "#", "#", "#"],
        ["#", "#", "#", "#", "#", "#", "#", "#", "#"],
        ["#", "#", "#", "#", "#", "#", "#", "#", "#"],
        ["#", "#", "#", "#", "B", "#", "#", "#", "#"],
    ],
    palette: {
        B: {
            onClick: {
                action: "navigate",
                to: "uighview",
            },
        },
    },
});

export const Shop = generateGui({
    id: "uighshop",
    name: "公会系统 / 公会商店",
    descriptions: [
        "在这个页面上你可以购买公会成员上架的物品，或是自行上架物品供他人购买",
        "所有公会商店中交易均使用公会币支付",
        "如果你的商品数很多，你可以用最右侧的上下按钮翻页",
    ],
    map: [
        ["#", "#", "#", "#", "#", "#", "#", "#", "#"],
        ["#", "#", "#", "#", "#", "#", "#", "#", "#"],
        ["#", "#", "#", "#", "#", "#", "#", "#", "#"],
        ["#", "#", "#", "#", "#", "#", "#", "#", "#"],
        ["#", "#", "#", "#", "#", "#", "#", "#", "#"],
        ["#", "#", "#", "#", "B", "#", "#", "#", "#"],
    ],
    palette: {
        B: {
            onClick: {
                action: "navigate",
                to: "uighview",
            },
        },
    },
});

export const Qd = generateGui({
    id: "uighqd",
    name: "公会系统 / 公会签到",
    descriptions: [
        "在这个页面上你可以使用水晶或者金币签到，一天只能签到一次",
        "水晶签到需支付 10 水晶，金币签到需支付 500 金币",
        "#emptyline",
        "每次签到可以获得 100 公会币",
        "VIP 会员可获得 2 倍公会币 (200)",
        "MVP 会员可获得 3 倍公会币 (300)",
        "CEO 会员可获得 5 倍公会币 (500)",
    ],
    map: [
        ["#", "#", "#", "#", "#", "#", "#", "#", "#"],
        ["#", "#", "#", "#", "#", "#", "#", "#", "#"],
        ["#", "#", "#", "#", "#", "#", "#", "#", "#"],
        ["#", "#", "#", "#", "#", "#", "#", "#", "#"],
        ["#", "#", "#", "#", "#", "#", "#", "#", "#"],
        ["#", "#", "#", "#", "B", "#", "#", "#", "#"],
    ],
    palette: {
        B: {
            onClick: {
                action: "navigate",
                to: "uighview",
            },
        },
    },
});

export const Task = generateGui({
    id: "uightask",
    name: "公会系统 / 公会任务",
    descriptions: [
        "在这个页面上你可以查看本周公会的集体任务",
        "公会中的每一个人都可以完成任务中的一部分，全部完成的任务会在结算时发放公会资金和活跃",
        "#emptyline",
        "公会任务每周日 12:00 结算",
    ],
    map: [
        ["#", "#", "#", "#", "#", "#", "#", "#", "#"],
        ["#", "#", "#", "#", "#", "#", "#", "#", "#"],
        ["#", "#", "#", "#", "#", "#", "#", "#", "#"],
        ["#", "#", "#", "#", "#", "#", "#", "#", "#"],
        ["#", "#", "#", "#", "#", "#", "#", "#", "#"],
        ["#", "#", "#", "#", "B", "#", "#", "#", "#"],
    ],
    palette: {
        B: {
            onClick: {
                action: "navigate",
                to: "uighview",
            },
        },
    },
});

export const Notice = generateGui({
    id: "uighnotice",
    name: "公会系统 / 公会任务",
    descriptions: [
        "在这个页面上你可以查看公会会长发布的公告",
        "公会会长可以消耗 100 公会资金发布新的公告，发布后所有公会成员都会收到信息",
    ],
    map: [
        ["#", "#", "#", "#", "#", "#", "#", "#", "#"],
        ["#", "#", "#", "#", "#", "#", "#", "#", "#"],
        ["#", "#", "#", "#", "#", "#", "#", "#", "#"],
        ["#", "#", "#", "#", "#", "#", "#", "#", "#"],
        ["#", "#", "#", "#", "#", "#", "#", "#", "#"],
        ["#", "#", "#", "#", "B", "#", "#", "#", "#"],
    ],
    palette: {
        B: {
            onClick: {
                action: "navigate",
                to: "uighview",
            },
        },
    },
});
